import random


class GiftWheelGame:
    def __init__(self):
        self.players = [] #รายชื่อผู้เล่น
        self.wheel = [] #รายชื่อในวงล้อ
        self.current_player = None #ผู้เล่นปัจจุบัน
        self.results = {} #ผลลัพธ์ของผู้เล่นแต่ละคน เช่น (ผู้เล่นAได้รับของขวัญของB)
        self.started = False #สถานะการเริ่มเกม

    # --------------------------------------------------------------------------------------------
    # add player to the game
    # เพิ่มผู้เล่นเข้าสู่เกม
    # --------------------------------------------------------------------------------------------

    def add_player(self, player_name):
        pass

    # --------------------------------------------------------------------------------------------
    # start the game
    # เริ่มเกม
    # --------------------------------------------------------------------------------------------
    def start_game(self):
        pass

    # --------------------------------------------------------------------------------------------
    # spin the wheel for the current player
    # หมุนวงล้อสำหรับผู้เล่นปัจจุบัน
    # --------------------------------------------------------------------------------------------
    def spin_wheel(self):
        pass

    # --------------------------------------------------------------------------------------------
    # chack the game this ended or not
    # ตรวจสอบว่าเกมจบหรือไม่
    # --------------------------------------------------------------------------------------------
    def game_is_finished(self):
        pass

    # --------------------------------------------------------------------------------------------
    # result of the game
    # ผลลัพธ์ของเกม
    # --------------------------------------------------------------------------------------------
    def get_results(self):
        pass

    # --------------------------------------------------------------------------------------------
    # reset the game
    # รีเซ็ตเกม
    # --------------------------------------------------------------------------------------------
    def reset_game(self):
        self.__init__()